{
  "projects": [
    {
      "_id": "0",
      "photo": "/findit.PNG",
      "title": "FindIt - Mobile mockup",
      "video": "https://www.figma.com/embed?embed_host=share&url=https%3A%2F%2Fwww.figma.com%2Ffile%2FhuCjOyDQET8RCxR8T2kaFG%2FFindIT%3Ftype%3Ddesign%26node-id%3D199%253A4285%26mode%3Ddesign%26t%3DrGmsCdSwvBlXbEH9-1",
      "date": "11/22/2021",
      "technologies": [
        "Figma"
      ],
      "short_description": "Design project for a warehouse management application.",
      "description": "Design of a mobile management application. FindIt is an application for designing, planning, and keeping track of movements on a warehouse in a visual and friendly way. This app is focused on being used in warehouses, but you can design and keep track of any inventory./*This concept was made to apply all the knowledge I acquired through our interface design course at university./*This project goes from all the phases of design, from the business model canvas to the task flow. As well from the app prototype in paper, doing the atomic design, to the high fidelity mockup./*Feel free to check all the pages in the figma link project to have all the details. This preview just shows the mockup for new users.",
      "links": [
        {
          "page": "figma",
          "link": "https://www.figma.com/file/huCjOyDQET8RCxR8T2kaFG/FindIT?type=design&node-id=199%3A4285&mode=design&t=rGmsCdSwvBlXbEH9-1" 
        }
      ]
    },
    {
      "_id": "1",
      "photo": "/jetpac.PNG",
      "title": "Jetpac - Game demo project",
      "video": "https://www.youtube.com/embed/AMSQMUOMJWo?si=h4VXgEy8R3ACy7ls",
      "date": "05/25/2021",
      "technologies": [
        "Java", "Greenfoot"
      ],
      "short_description": "Game demo based on the 1983 game ''Jetpac'' from Rare.",
      "description": "A game demo based on the 1983 game ''Jetpac'' from Ultimate Play The Game, later known as Rare. This project was developed with the purpose of applying the knowledge of object-oriented programming./*Using Java and a ''game engine'' called Greenfoot, I emulated the features of the original game while adding some of my own ideas./**I do not own any of the assets used in the project. This project was made just for learning purposes.*",
      "links": [
        {
          "page": "youtube",
          "link": "https://youtu.be/AMSQMUOMJWo"
        }
      ]
    },
    {
      "_id": "2",
      "photo": "/zelda.PNG",
      "title": "Hyrule fantasy - Game demo project",
      "video": "https://www.youtube.com/embed/vgXfltk1NkA?si=iaS9JedbDHc3aqdm",
      "date": "12/02/2019",
      "technologies": [
        "C language", "graphics.h"
      ],
      "short_description": "Demo project written in C based on a typical zelda game.",
      "description": "A little game demo inspired by the zelda games. The main goal with the development of this project, is to practice and have a deeper understanding of how pointers and memory allocation work in C./*All the game entities work over a mesh (you can see it as a double-linked list), where every node is a pointer connected to another pointer node on its left, right, up, and down. This helps other entities (player, enemies, tiles of the map) get a location in the world where they can move in every direction./*All the sprites are text files that store numbers. These numbers are interpreted by the graphics.h library/header that helps showing images/figures on the screen./**I do not own any of the ideas and/or assets used in the project. This project was made just for learning purposes.*",
      "links": [
        {
          "page": "github",
          "link": "https://github.com/Damagd/hyr-fan"
        },
        {
          "page": "youtube",
          "link": "https://youtu.be/vgXfltk1NkA"
        }
      ]
    },
    {
      "_id": "3",
      "photo": "/queue.PNG",
      "title": "Queues - visual simulation project",
      "video": "https://www.youtube.com/embed/dFPNW2VJo8M?si=COiyJdC4TkeoZPYm",
      "date": "10/12/2019",
      "technologies": [
        "C language", "graphics.h"
      ],
      "short_description": "Little simulation on how queues works using C.",
      "description": "A small project about a simulation of how a queue works using a real life situation. The point of this project is to simulate a ticket office queue using queues, stacks and linked lists in C./*On the most part of the simulation, the queue behaves in a FIFO manner, but when a person wants to leave the queue, the behavior changes to a stack, where the people behind need to leave the queue before he can move.",
      "links": [
        {
          "page": "github",
          "link": "https://github.com/Damagd/queue-simulation"
        },
        {
          "page": "youtube",
          "link": "https://youtu.be/dFPNW2VJo8M"
        }
      ]
    },
    {
      "_id": "4",
      "photo": "/metro.PNG",
      "title": "Subway lines - Graphs",
      "video": "https://www.youtube.com/embed/yVuFibadaLI?si=ASjq5fMCSdfJu4nq",
      "date": "11/08/2019",
      "technologies": [
        "C language", "graphics.h"
      ],
      "short_description": "Little demostration about how to work with graphs.",
      "description": "A small visual program of how we can use graphs in a real-life situation. Every station is a node, and all the subway lines represent the complete graph./*Selecting a starting point and a destination, the program follows a path which takes the next station, so it can reach the final point.",
      "links": [
        {
          "page": "github",
          "link": "https://github.com/Damagd/subway"
        },
        {
          "page": "youtube",
          "link": "https://youtu.be/yVuFibadaLI"
        }
      ]
    }
  ]
}